a = int(input("Введите число: "))
N1a = ["один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
N1b = ["одна", "две", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
N2 = ["одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]
N3 = ["десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
N4 = ["сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"]
N5 = ["тысяча", "тысячи", "тысяч"]
N6 = ["рубль", "рубля", "рублей"]
a1 = a // 100000
a2 = (a // 10000) % 10
a3 = (a // 1000) % 10
a4 = (a // 100) % 10
a5 = (a // 10) % 10
a6 = a % 10
quit = ""
if a1 != 0:
    i1 = a1 - 1
    quit += N4[i1] + " "
if a2 == 1 and a3 == 0:
    quit += N3[0] + " "
if a2 != 1:
    if a2 != 0:
        i2 = a2 - 1
        quit += N3[i2] + " "
if a3 != 0:
    if a2 == 1:
        i3 = a3 - 1
        quit += N2[i3] + " " + N5[2] + " "
    else:
        i3 = a3 - 1
        quit += N1b[i3] + " "
        if a3 == 1:
            quit += N5[0] + " "
        elif 1 < a3 < 5:
            quit += N5[1] + " "
        else:
            quit += N5[2] + " "
if (a3 == 0) and (a2 or a1 != 0):
    quit += N5[2] + " "
if a4 != 0:
    i4 = a4 - 1
    quit += N4[i4] + " "
if a5 == 1 and a6 == 0:
    quit += N3[0] + " "
if a5 != 1:
    if a5 != 0:
        i5 = a5 - 1
        quit += N3[i5] + " "
if a6 != 0:
    if a5 == 1:
        i6 = a6 - 1
        quit += N2[i6] + " " + N6[2]
    else:
        i6 = a6 - 1
        quit += N1a[i6] + " "
        if a6 == 1:
            quit += N6[0] + " "
        elif 1 < a6 < 5:
            quit += N6[1] + " "
        else:
            quit += N6[2] + " "
if (a6 == 0) and (a5 or a4 or a3 or a2 or a1 !=0):
    quit += N6[2]
quit = quit.capitalize()
print(quit)